Revit 2023 API
RebarUpdateCurvesData Methods
The RebarUpdateCurvesData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAttachmentType
 Returns attachment type for stirrups to be used in cover calculation.
GetBarGeometry
 Returns the geometry for a bar at the specified index currently in the Rebar.
GetBarModelDiameter
 Gets the model diameter of the Rebar.
GetBarNominalDiameter
 Gets the nominal diameter of the Rebar.
GetBarsNumber
 Gets the number of bars specified in the layout options. This is used to calculate the sets driven by bar number.
GetBendingRadius
 Gets the current bending radius of the rebar.
GetChangedCustomHandles
 Returns an array containing custom handles that were changed since the last regeneration. Array is empty if no handles were changed since the last regeneration.
GetChangedSharedParameterGUIDs
 Returns an array containing the shared parameter GUIDs that were changed since the last regeneration. Array is empty if no shared params were changed since the last regeneration.
GetCustomConstraints
 Gets all rebar constraints that are attached to custom handles for this rebar.
GetDocument
 Gets a reference to the current document.
GetEndConstraint
 Gets the current constraint for the end handle of the Rebar.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetHookOrientationAngle
 Get the hook orientation angle at end that is currently in the rebar.
GetHookPlaneNormalForBarIdx
 Returns the normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.
GetHostId
 Gets the id of the host structural for this rebar.
GetLayoutRule
 Gets the layout rule for this bar.
GetNumberOfBars
 Returns the number of bars currently in the rebar.
GetRebarId
 Get the id of the Rebar element currently being calculated.
GetRebarStyle
 Gets the style of the rebar.
GetStartConstraint
 Gets the current constraint for the start handle of the Rebar.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetHookOrientationAngle
 Set the hook orientation angle at end. This information is set to the rebar after the API execution is finished successfully.
SetHookPlaneNormalForBarIdx
 Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace